---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.FluidTemperature.Viscosity
source: html/fee182d4-5e5e-0b27-58da-5e2ce2b986fb.htm
---
# Autodesk.Revit.DB.Plumbing.FluidTemperature.Viscosity Property

The dynamic viscosity value

## Syntax (C#)
```csharp
public double Viscosity { get; set; }
```